# Latitude Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..Latitude Property
SunAndShadowSettings Class See Also
---
Identifies the current latitude used by the SunAndShadowSettings element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double Latitude { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Latitude As Double
	Get
```

Visual C++
---
```text
public:
property double Latitude {
	double get ();
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace